Revit 2024 API
Ellipse.RadiusY Property
Returns the Y vector radius of the ellipse.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double RadiusY { get; }
Visual Basic
Public ReadOnly Property RadiusY As Double
	Get
Visual C++
public:
property double RadiusY {
	double get ();
}
See Also
Ellipse Class
Autodesk.Revit.DB Namespace